Revit 2026 API

# ViewSheetSettingAvailableViews Property

---

All views that can be printed.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public ViewSet AvailableViews { get; }
```
```vb
Public ReadOnly Property AvailableViews As ViewSet
	Get
```
```cpp
public:
property ViewSet^ AvailableViews {
	ViewSet^ get ();
}
```
```fsharp
member AvailableViews : ViewSet with get
```

#### Property Value

ViewSet

Users can select the view/sheet from this view set to printing.

#### Reference

ViewSheetSetting Class

Autodesk.Revit.DB Namespace